Revit 2027 API
ParameterTypeId.SystemsAnalysisReportStyle Property
 "Report Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SystemsAnalysisReportStyle { get; }
Public Shared ReadOnly Property SystemsAnalysisReportStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SystemsAnalysisReportStyle {
	ForgeTypeId^ get ();
}
static member SystemsAnalysisReportStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace